Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/asylum_seekers_and_refugees/refugee_status_and_leave_to_remain/accommodation_for_refugees.html.txt.tmx
Source language: en
Languages: ga

source: Accommodation for people granted refugee status or subsidiary protection or given permission to remain
ga: Cóiríocht do dhaoine ar deonaíodh stádas dídeanaí nó cosanta coimhdí dóibh nó ar tugadh cead dóibh chun fanacht

source: • Convention refugees, people given subsidiary protection or permission to remain
ga: • Dídeanaithe coinbhinsiún agus daoine ar tugadh cosaint choimhdeach nó cead dóibh chun fanacht

source: Accommodation is provided for Programme refugees when they arrive in the State
ga: Cuirtear cóiríocht ar fáil do dhídeanaithe Cláir nuair a thagann siad isteach sa Stát

source: This accommodation may be in a reception centre, a bed and breakfast, a hotel, a hostel, a house, a flat or an apartment
ga: D’fhéadfadh go mbeadh an chóiríocht seo i bhfoirm ionad fáiltithe, leaba agus bricfeasta, óstán, brú, teach nó árasán

source: Convention refugees, people given subsidiary protection or permission to remain
ga: Dídeanaithe coinbhinsiún agus daoine ar tugadh cosaint choimhdeach nó cead dóibh chun fanacht

source: If you have been granted international protection (refugee status or subsidiary protection) or permission to remain and you have been living in a direct provision accommodation centre, you will have to leave that centre and move into other accommodation
ga: Má deonaíodh cosaint idirnáisiúnta (stádas dídeanaí nó cosanta coimhdí) nó cead duit chun fanacht agus ma bhí cónaí ort in ionad cóiríochta soláthair dhírigh, beidh ort an t-ionad sin a fhágáil agus aistriú isteach i gcóiríocht eile

source: This may be in social housing (public housing) or in private rented housing
ga: D’fhéadfadh seo a bheith i dtithíocht shóisialta (tithíocht phoiblí) nó i dtithíocht phríobháideach ar cíos

source: You can now move to live in any part of the State that you wish
ga: Is féidir leat bogadh anois chun cónaí in aon chuid den Stát is mian leat

source: If you were already living in private rented accommodation, your change of status will not affect your immediate housing circumstances
ga: Má bhí cónaí ort cheana féin i gcóiríocht phríobháideach ar cíos, ní imreoidh d’athrú stádais tionchar ar do chúinsí láithreacha tithíochta

source: You can read more information about finding accommodation in this guide to living independently (pdf) for people who have been granted refugee status or subsidiary protection or permission to remain
ga: Féadfaidh tú níos mó faisnéise a léamh faoi chóiríocht a aimsiú sa treoir seo maidir le maireachtáil neamhspleách (pdf) do dhaoine ar deonaíodh stádas dídeanaí nó cosanta coimhdí dóibh nó ar tugadh cead dóibh chun fanacht

source: Local authorities are the main providers of social housing for people who cannot afford to buy their own homes
ga: Is iad na húdaráis áitiúla is mó a chuireann tithíocht shóisialta ar fáil do dhaoine nach bhfuil sé d’acmhainn acu a dtithe féin a cheannach

source: Local authority housing is allocated according to eligibility and need
ga: Cuirtear tithíocht údaráis áitiúil ar fáil do dhaoine de réir incháilitheachta agus riachtanas

source: Rents are based on the household’s ability to pay
ga: Tá cíosanna bunaithe ar chumas an teaghlaigh chun íoc

source: Housing associations and housing co-operatives also provide social housing for people who cannot afford to buy their own homes
ga: Cuireann comhlachais tithíochta agus comharchumainn tithíochta, chomh maith leis sin, tithíocht shóisialta ar fáil do dhaoine nach bhfuil in ann a gcuid tithe féin a cheannach

source: You should register at the office of your local authority to go on the waiting list for housing
ga: Ba cheart duit clárú a dhéanamh ag oifig d’údaráis áitiúil go gcuirfear thú ar an liosta feithimh le haghaidh tithíochta

source: The local authorities have a number of housing options depending on your income level and housing need
ga: Tá roinnt roghanna tithíochta ag na húdaráis áitiúla ag brath ar do leibhéal ioncaim agus do riachtanas tithíochta

source: If you do not qualify for social housing or if there is a long waiting list for social housing, you should consider living in private rented accommodation, which you will have to find yourself
ga: Mura gcáilítear thú do thithíocht shóisialta nó má tá liosta fada feithimh ann do thithíocht shóisialta, ba cheart duit machnamh a dhéanamh ar chónaí i gcóiríocht phríobháideach ar cíos, a bheidh ort féin a aimsiú

source: You may qualify for financial help with paying the rent under one of the following schemes:
ga: B’fhéidir go gcáileoidh tú do chúnamh airgeadais maidir leis an gcíos a íoc faoi cheann de na scéimeanna a leanas:

source: • The Housing Assistance Payment (HAP) is being introduced as a form of social housing support for people who have a long-term housing need
ga: • Tá an Íocaíocht Cúnaimh Tithíochta (ÍCT) á tabhairt isteach mar fhoirm de thacaíocht tithíochta sóisialta do dhaoine a bhfuil riachtanas fadtéarmach tithíochta acu

source: It is being administered by local authorities – see ‘Where to apply’ below
ga: Tá an íocaíocht á riar ag údaráis áitiúla – féach ‘Cá ndéanfaidh mé iarratas? ’ thíos

source: • If you live in a county where HAP is not yet available, a Rent Supplement may be paid by your local Department of Social Protection's representative (formerly known as the Community Welfare Officer) if you do not have the means to pay for the rent yourself
ga: • Má chónaíonn tú i gcontae nach bhfuil an ÍCT ar fáil go fóill ann, féadfaidh d’ionadaí áitiúil den Roinn Coimirce Sóisialaí Forlíonadh Cíosa a íoc leat (tugadh an tOifigeach Leasa Pobail ar an duine seo roimhe seo) mura bhfuil an mhaoin agat chun íoc as an gcíos tú féin

source: When you find a house or flat to rent you should apply to the Department's representative for Rent Supplement – see 'Where to apply' below
ga: Nuair a aimsíonn tú teach nó árasán lena fháil ar cíos, ba cheart duit iarratas a dhéanamh le hionadaí na Roinne ar Fhorlíonadh Cíosa – féach ‘Cá ndéanfaidh mé iarratas? ’ thíos

source: The Residential Tenancies Board has published a guide on being a good tenant (pdf)
ga: D’fhoilsigh an Bord um Thionóntachtaí Cónaithe Príobháideacha treoir maidir le bheith i do thionónta maith (pdf)

source: If you find yourself homeless or you think you may lose your home, you should generally contact your local authority to access accommodation
ga: Má bhíonn easpa dídine ort nó má cheapann tú go mb’fhéidir go gcaillfidh tú do theach, ba cheart duit teagmháil a dhéanamh, go ginearálta, le d’údarás áitiúil chun rochtain a fháil ar chóiríocht

source: In Dublin and Cork, the local authorities and the Department of Social Protection provide dedicated services for homeless people
ga: I mBaile Átha Cliath agus i gCorcaigh, soláthraíonn na húdaráis áitiúla agus an Roinn Coimirce Sóisialaí seirbhísí tiomnaithe do dhaoine gan dídean

source: Our document on agencies that provide services for homeless people gives details of where to apply for the various supports
ga: Tugtar sonraí inár gcáipéis ar ghníomhaireachtaí a sholáthraíonn seirbhísí do dhaoine gan dídean faoin áit ar cheart iarratas a dhéanamh ar na tacaíochtaí éagsúla

source: If you have sufficient finance and a regular income, you can apply for a mortgage to buy a house
ga: Má tá dóthain airgeadais agus ioncam rialta agat, féadfaidh tú iarratas a dhéanamh ar mhorgáiste chun teach a cheannach

source: Contact your local authority
ga: Déan teagmháil le d’údarás áitiúil

source: Contact the Department’s representative
ga: Déan teagmháil le hionadaí na Roinne
